---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsConstructionMethod.Assembled
enum: Autodesk.Revit.DB.Architecture.StairsConstructionMethod
source: html/baaba95a-8e1d-d002-2431-baaef362f060.htm
---
# Autodesk.Revit.DB.Architecture.StairsConstructionMethod.Assembled

The stairs is constructed by assembly method.